/*******************************************************************************
* タイトル:		Gameヘッダーファイル
* プログラム名:	Game.h
* 作成者:		GP11A331 4 伊原佑稀
* 作成日:		2016/02/23
********************************************************************************
* 更新履歴:		- 2016/02/23	GP11A331 4 伊原佑稀
*					- V1.00		Initial Version
*******************************************************************************/
#ifndef _GAME_H_
#define _GAME_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "Main.h"

/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* 列挙体定義
*******************************************************************************/
// ゲームモード
typedef enum
{
	GAME_MODE_HOME = 0,
	GAME_MODE_TRAINING,	// トレーニング
	GAME_MODE_REST,		// 休憩
	GAME_MODE_CONTACT,	// 触れ合い
	GAME_MODE_FOOD,		// エサあげ
	GAME_MODE_CAMERA,	// カメラ切り替え
	GAME_MODE_HISTORY,	// クラゲ図鑑
	GAME_MODE_OPTION,	// オプション切り替え
	GAME_MODE_MAX
} GAME_MODE;
// トレーニングモード
typedef enum
{
	TRAINING_MODE_INTELLIGENCE = 0,		// 知性トレーニング
	TRAINING_MODE_MOBILITY,				// 体力トレーニング
	TRAINING_MODE_SENSIBILLITY,			// 感性トレーニング
	TRAINING_MODE_JUSTICE,				// 正義感トレーニング
	TRAINING_MODE_MAX
} TRAINING_MODE;
/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
void SetGameMode(int mode);
GAME_MODE GetGameMode(void);
void SetTraningMode(int mode);
TRAINING_MODE GetTraningMode(void);

#endif