/*******************************************************************************
* タイトル:		UI処理
* プログラム名:	UI.h
* 作成者:		GP11A331 4番 伊原佑稀
* 作成日:		2016/02/01
********************************************************************************
* 更新履歴:		- 2016/02/25	伊原佑稀
*					- V1.00		Initial Version
*******************************************************************************/
#ifndef _UI_H_
#define _UI_H_

#include "Main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************

/*******************************************************************************
* 列挙体定義
*******************************************************************************/
// アドバイスの種類
typedef enum
{
	ADIVCE_FINE = 0,
	ADVICE_DYING,
	ADVICE_TIRED,
	ADVICE_TYPE_MAX
} ADVICE_TYPE;

/*****************************************************************************
* 構造体
*****************************************************************************/
// テクスチャの情報
typedef struct
{
	LPDIRECT3DVERTEXBUFFER9	pD3DVtxBuff;	//頂点バッファインターフェースへのポインタ
	D3DXVECTOR3 vPos;						
	D3DXVECTOR3 vScl;
	D3DXCOLOR	col;
	int			nCnt;
	bool		bUse;
	bool		bChoice;
	D3DXVECTOR2 vTexPatSize;					//テクスチャのどの部分をポリゴンに貼るか決める変数
}UI_2D;

// テクスチャ3DでのUI
typedef struct
{
	D3DXMATRIX mtxWorld;					//ワールドマトリックス
	LPDIRECT3DVERTEXBUFFER9	pD3DVtxBuff;	//頂点バッファインターフェースへのポインタ
	D3DXVECTOR3 vPos;
	D3DXVECTOR3 vRot;
	D3DXVECTOR3 vScl;
	D3DXCOLOR	col;
	int			nCnt;
	bool		bUse;
	bool		bChoice;
	D3DXVECTOR2 vTexPatSize;				
	D3DXVECTOR3 vVtxPos[4];					//ビルボード当たり判定用の頂点座標
}UI_3D;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);

#endif
